# ExportOnlyViewId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..ExportOnlyViewId Property
DWFExportOptions Class See Also
---
Only export the specified view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ElementId ExportOnlyViewId { get; set; }
```

Visual Basic
---
```text
Public Property ExportOnlyViewId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ExportOnlyViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
Export only the specified view, but the data of the other views is still used, e. g. the hyperlink information.
# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace